# coding=utf-8
import vk_api
import time

vk = vk_api.VkApi(token="1717c3751aef93f3c8433b3f6601a1a417a5e8bef158fab182e7f22b327919a7e1931af18b7dca0333e39")
vk._auth_token()

#считываем последние сообщения от пользователя
values = {'out' : 0, 'count': 100,'time_offset':60}
response = vk.method('messages.get', values)
dictUsers = {}
dictLists = {}

#отправляем сообщения
def write_msg(user_id, s):
    vk.method('messages.send', {'user_id':user_id,'message':s})


spisok = [["то","сейчас","тут","лицо","каждый","друг","нет","теперь","ни","глаз","тоже","тогда","видеть","вопрос","через","да","здесь","дом","да","потому","сторона","какой-то","думать","сделать","страна","жить","чем","мир","об","последний","случай","голова","более","делать","что-то","смотреть","ребенок","просто","конечно","сила","российский","конец","перед","несколько","вид","система","всегда","работать","между","три","нет","понять","пойти","часть","спросить","город","дать","также","никто","понимать","получить","отношение","лишь","второй","именно","ваш","хотя","ни","сидеть","над","женщина","оказаться","русский","один","взять","прийти","являться","деньги","почему","вдруг","любить","стоить","почти","земля","общий","ведь","машина","однако","сразу","хорошо","вода","отец","высокий","остаться","выйти","много","проблема","начать","хороший","час","это","сегодня","право","совсем","нога","считать","главный","решение","увидеть","дверь","казаться","образ","писать","история","лучший","власть","закон","все","война","бог","голос","найти","поэтому","стоять","вообще","тысяча","больше","вместе","маленький","книга","некоторый","решить","любой","возможность","результат","ночь","стол","никогда","имя","область","молодой","пройти","например","статья","оно","число","компания","про","государственный","полный","принять","народ","никакой","советский","жена","настоящий","всякий","группа","развитие","процесс","суд","давать","ответить","старый","условие","твой","пока","средство","помнить","начало","ждать","свет","пора","путь","душа","куда","нужно","разный","нужный","уровень","иной","форма","связь","уж","минута","кроме","находиться","опять","многий","белый","собственный","улица","черный","написать","вечер","снова","основной","качество","мысль","дорога","мать","действие","месяц","оставаться","государство","язык","любовь","взгляд","мама","играть","далекий","лежать","нельзя","век","школа","подумать","уйти","цель","среди","общество","посмотреть","деятельность","организация","кто-то","вернуться","президент","комната","порядок","момент","театр","следовать","читать","письмо","подобный","следующий","утро","особенно","помощь","ситуация","роль","бывать","ходить","рубль","начинать","появиться","смысл","состояние","называть","рядом","квартира","назад","равный","из-за","орган","внимание","тело","труд","прийтись","хотеться","сын","мера","пять","смерть","живой","рынок","программа","задача","предприятие","известный","окно","вести","совершенно","военный","разговор","показать","правительство","важный","семья","великий","производство","простой","значит","третий","сколько","огромный","давно","политический","информация","действительно","положение","поставить","бояться","наконец","центр","происходить","ответ","муж","автор","все-таки","стена","существовать","даже","интерес","становиться","федерация","правило","оба","часто","московский","управление","слышать","быстро","смочь","заметить","как-то","мужчина","долго"]
    ,["правда","идея","партия","иногда","использовать","пытаться","готовый","чуть","зачем","представить","чувствовать","создать","совет","счет","сердце","движение","вещь","материал","неделя","чувство","затем","данный","заниматься","продолжать","красный","глава","ко","слушать","наука","узнать","ряд","газета","причина","против","плечо","современный","цена","план","приехать","речь","четыре","отвечать","точка","основа","товарищ","культура","слишком","рассказывать","вполне","далее","рассказать","данные","представлять","мнение","социальный","около","документ","институт","ход","брать","забыть","проект","ранний","встреча","особый","целый","директор","провести","спать","плохой","может","впрочем","сильный","наверное","скорый","ведь","срок","палец","опыт","помочь","больше","приходить","служба","крупный","внутренний","просить","вспомнить","открыть","привести","судьба","пока","девушка","поскольку","очередь","лес","пусть","экономический","оставить","правый","состав","словно","федеральный","спрашивать","принимать","член","искать","близкий","количество","похожий","событие","объект","зал","создание","войти","различный","значение","назвать","достаточно","период","хоть","шаг","необходимый","успеть","произойти","брат","искусство","единственный","легкий","структура","выходить","номер","предложить","пример","пить","исследование","гражданин","глядеть","человеческий","игра","начальник","сей","рост","ехать","международный","тема","принцип","дорогой","попасть","десять","начаться","верить","метод","тип","фильм","небольшой","держать","либо","позволять","край","местный","менее","гость","купить","уходить","собираться","воздух","туда","относиться","бывший","требовать","характер","борьба","использование","кстати","подойти","размер","удаться","образование","получать","мальчик","кровь","район","небо","американский","армия","класс","представитель","участие","девочка","политика","сначала","герой","картина","широкий","доллар","спина","территория","мировой","пол","тяжелый","довольно","поле","ж","изменение","умереть","более","направление","рисунок","течение","возможный","церковь","банк","отдельный","средний","красивый","сцена","население","большинство","сесть","двадцать","случиться","музыка","короткий","правда","проходить","составлять","свобода","память","приходиться","причем","команда","установить","союз","будто","поднять","врач","серьезный","договор","стараться","уметь","встать","дерево","интересный","факт","добрый","всего","хозяин","национальный","однажды","длинный","природа","домой","страшный","прошлый","будто","общественный","угол","чтоб","телефон","позиция","проводить","скоро","наиболее","двор","обычно","бросить","разве","писатель","самолет"]
    ,["объем","далеко","род","солнце","вера","берег","спектакль","фирма","способ","завод","цвет","трудно","журнал","руководитель","специалист","возможно","детский","точно","объяснить","оценка","единый","снять","определенный","низкий","нравиться","услышать","регион","связать","песня","процент","родитель","позволить","чужой","море","странный","требование","чистый","весьма","какой-нибудь","основание","половина","поехать","положить","входить","легко","поздний","роман","круг","анализ","стихи","автомобиль","специальный","экономика","литература","бумага","вместо","впервые","видно","научный","оказываться","поэт","показывать","степень","вызвать","касаться","господин","надежда","сложный","вокруг","предмет","отметить","заявить","вариант","министр","откуда","реальный","граница","действовать","дух","модель","операция","пара","сон","немного","название","ум","повод","старик","способный","мало","миллион","малый","старший","успех","практически","получиться","личный","счастье","необходимо","свободный","ребята","обычный","кабинет","прекрасный","высший","кричать","прежде","магазин","пространство","выход","остановиться","удар","база","знание","текст","сюда","темный","защита","предлагать","руководство","вовсе","площадь","сознание","гражданский","убить","возраст","молчать","согласиться","участник","участок","рано","пункт","несмотря","сильно","столь","сообщить","линия","бежать","желание","папа","кажется","петь","доктор","губа","известно","дома","вызывать","дочь","показаться","среда","председатель","представление","солдат","художник","принести","волос","оружие","выглядеть","соответствие","никак","ветер","внешний","парень","служить","зрение","попросить","генерал","состоять","огонь","отдать","боевой","понятие","строительство","ухо","выступать","грудь","нос","ставить","завтра","возникать","когда","страх","услуга","рабочий","что-нибудь","глубокий","содержание","радость","безопасность","надеяться","продукт","видимо","комплекс","бизнес","подняться","вспоминать","мало","сад","долгий","одновременно","называться","сотрудник","лето","тихо","зато","прямой","курс","помогать","предложение","финансовый","открытый","почему-то","значить","возникнуть","рот","где-то","технология","знакомый","недавно","реформа","отсутствие","нынешний","собака","камень","будущее","звать","рассказ","контроль","позвонить","река","хватать","продукция","сумма","техника","исторический","вновь","народный","прямо","ибо","выпить","здание","сфера","знаменитый","иначе","потерять","необходимость","больший","фонд","иметься","вперед","подготовка","вчера","лист","пустой","очередной","республика","хозяйство","полностью","получаться","учиться","плохо","воля","судебный","бюджет","возвращаться","расти","снег","деревня","обнаружить","мужик","постоянно","зеленый","элемент","обстоятельство","почувствовать","немец","многое","победа","источник","немецкий","золотой","передать","технический","нормальный","едва","желать","ожидать","некий","звезда","городской","выбор","соответствующий","масса","составить","итог","сестра","что","шесть","ясно","практика","сто","нести","определить","проведение","карман","любимый","родной","западный","обязательно","слава","кухня","определение","пользоваться","быстрый"]]

i = 0
imax = len(spisok)


def foo(response):
    global i
    for item in response:
        curr = 0
        lst = 0
        if item['user_id'] not in dictUsers:
            dictUsers[item['user_id']] = 0
            dictLists[item['user_id']] = i
            curr = 0
            lst = i
            i+=1
        else:
            dictUsers[item['user_id']] = dictUsers[item['user_id']]+1
            curr = dictUsers[item['user_id']]
            lst = dictLists[item['user_id']]
        if i >= len(spisok):
            i=0
        if curr >= len(spisok[lst]):
            write_msg(item['user_id'], "Спасибо за помошь ты лучший(ая) ♥")
        else:
            write_msg(item['user_id'], spisok[lst][curr])
    time.sleep(1)


#
while True:
    response = vk.method('messages.get', values)
    if response['items']:
        values['last_message_id'] = response['items'][0]['id']
        foo(response['items'] )
